[
  {
    "id": "m4xUEMtu9rQupWMjdWpfpw",
    "url": "https://th.linkedin.com/jobs/view/product-management-at-shopee-3712357570?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=m4xUEMtu9rQupWMjdWpfpw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Product Management\nShopee  กรุงเทพมหานคร\n14 ชั่วโมงก่อน  ผู้สมัคร 158 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\n\n\nPerform User Acceptance Test (UAT) for newly implemented functions.\nDesign and generate training materials for internal and external users.\nAnalyze, align, and evaluate business requirements, feasibility, and value of the feature requests with both business and regional product teams to deliver a comprehensive and accurate Business Requirement Document (BRD).\nDrive and own high-level strategic initiatives, and simultaneously, hands-on with the ability to roll up your sleeves and get things done.\n\n\n\n\nRequirements\n\n\n\n\nDetail-oriented with a demonstrated ability to self-motivate and follow through on projects.\nSelf-starter and a quick learner, independent and flexible, with a strong customer focus.\nStrong stakeholder management skills with a customer-oriented and execution-focused mindset.\nStrong verbal and written communication skills and English speaking is a must to collaborate with internal stakeholders.\nAbility to adapt in a fast-paced and agile environment, with a willingness and attitude to learn new tasks.\n1 - 2 years of work experience in the E-Commerce, Supply Chain or internet service industry is a plus.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการสินค้าและการตลาด\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "yNOsHf82EiXWeDiKuC2t7A",
    "url": "https://th.linkedin.com/jobs/view/doctoral-student-at-faculty-of-medicine-siriraj-hospital-mahidol-university-3773059557?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=yNOsHf82EiXWeDiKuC2t7A%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Doctoral Student\nFaculty of Medicine Siriraj Hospital, Mahidol University  กรุงเทพมหานคร\n12 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Faculty of Medicine Siriraj Hospital, Mahidol University ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Faculty of Medicine Siriraj Hospital, Mahidol University\n\nPunn Augsornworawat\nPunn Augsornworawat\nPrincipal Investigator / Lecturer\nRole Description\nThis is a full-time on-site doctoral student role located in Bangkok at Faculty of Medicine Siriraj Hospital, Mahidol University. The Doctoral student will perform research in the medical field under the guidance and supervision of experienced faculty members, participate in academic activities, and present research findings at scientific meetings and conferences.\n\nQualifications\n\nBachelor's or master's degree in Medical Science, Biology, or a related field\nExcellent academic record with a GPA of 3.5 or above, or equivalent\nGood command of English\nDemonstrated strong interest in medical research, excellent critical thinking skills, and proficiency in research methodology\nExcellent communication skills and ability to work independently and in a team environment\nแสดงเพิ่มเติม \nระดับประสบการณ์\nนักศึกษาฝึกงาน\nประเภทการจ้างงาน\nงานเต็มเวลา\nอุตสาหกรรม\nการศึกษาระดับอุดมศึกษา\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Faculty of Medicine Siriraj Hospital, Mahidol University ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "WEUxr9JuPJrgTv6DY8Gsig",
    "url": "https://th.linkedin.com/jobs/view/compliance-shopee-at-shopee-3631273610?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=WEUxr9JuPJrgTv6DY8Gsig%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Compliance (Shopee)\nShopee  กรุงเทพมหานคร\n13 ชั่วโมงก่อน  ผู้สมัคร 108 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\n\n\nProvide legal advice for operational activities as well as business initiatives across all company functions\nOffer expert regulatory counsel on diverse areas, including product listing control,customer protection, intellectual property, personal data protection, competition law, etc\nEngage in dynamic collaboration with cross-functional teams to ensure internal control measures\nDevelop, maintain and review company terms, policies and key communications to ensure adherence to legal requirements\nLiaise with company's affiliates to align business operations with the company's strategic direction and ensure compliance with relevant laws and regulations\nResponsible for the management of compliance risks associated with the organization\nStay updated and monitor changes of applicable laws and industry standards\n\n\n\n\nRequirements\n\n\n\n\nBachelor's or Master’s degree in law from an accredited university\nMinimum 5-year experience with a preferred combination of law firm and in-house Experience\nHighly critical and analytical thinking with strong attention to detail\nAbility to multitask, prioritize, maintain flexibility in a fast-paced environmentOutstanding communication and interpersonal skills in Thai and English\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการเงินและSales\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "a+cpsxP6PmMLNtuXdtS0fQ",
    "url": "https://th.linkedin.com/jobs/view/supply-network-operations-manager-at-procter-gamble-3714001722?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=a%2BcpsxP6PmMLNtuXdtS0fQ%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Supply Network Operations Manager\nProcter & Gamble  กรุงเทพมหานคร\n4 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ Procter & Gamble ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Location\n\nBangkok\n\nJob Description\n\nOverview of the job\n\nDID YOU KNOW THAT AT P&G WE CONSIDER THE SUPPLY NETWORK OPERATIONS (SNO) AS THE ENGINE THAT ACCELERATES VALUE CREATION?\n\nGetting thousands of different products onto the shelves in our customer's stores in the right quantities with precise quality in a very good time manner really does present a new challenge every single day. P&G’s Supply Network Operations (SNO) organization is there to meet these challenges: Forecasting customer demand, Handling the information flows from orders, shipments and invoices and leading the physical distribution process from Distribution Centre to the customer’s shelf.\n\nBy joining us in the supply chain, you can help us develop highly sophisticated, more integrated approaches, taking advantage of the latest advancements in digitized plants and connected inquisitive technology. Our aim is to ignite your potential and equip you to improve the efficiency and sustainability of our supply chain operation.\n\nThis job will enable the end-to-end management to internal function in P&G and to customer outside of P&G organization. As supply chain manager, you will manage the demand forecasting by working with sales and marketing, initiative launch management as well as distribution logistic management where we connect directly to our customers to build end-to-end joint value using supply chain solutions, balancing service, cost and cash. Also, developing relationships between different functions i.e. Sales, logistics, order management team from both inside P&G organization and at customers. We represent P&G externally toward customers and also being customer representation within P&G.\n\nYour team\n\nYou will be in the logistic team and working with a multi-function team. You will report to the supply chain director.\n\nHow Success Looks Like\n\nEnsuring Service: Build positive relationship with key customer contacts and deliver fundamental Key Performance\n\nEvaluating Service: Understand End to End cost and improve cost efficiency\n\nOptimizing the Supply Chain: Develop Supply Chain efficiencies and optimizations targeting\n\nCrafting and Commercializing Total Share Holder Return: Build positive relationship and add value with the key stockholder\n\nDeveloping Organization Capability 360°\n\nResponsibilities Of The Role\n\n\nDeveloping relationships: internally with the Sales Team and externally with the customer's key decision-makers and information sources (\"Process Leaders\", \"Contributors\" and \"Executers\").\nAssessing the customer: their logistics requirements, inventory capabilities and emerging needs – market requirements.\nProviding the forecast based on customer and sales team insights and able to communicate the change in the forecast to broader team and ensure that the forecast is 50:50 (non bias forecast)\nAnalyse the SKU productivity and propose which SKU to be optimized and seek alignment from all parties involve.\nCreating Supply Chain Customer Business Plans: create and prioritize Joint Value Creation logistics plans, lead Supply Chain Joint Business plans, gain customer and sales alignment, and implement the plans to deliver team results.\nCapturing and quantifying customers/P&G Joint Value Creation opportunities\nImproving and aligning inter-company processes: impact on product flow, information flow and financial flow.\nIncreasing interpersonal capacity and capability: actively work across the Team, P&G and Customer Organizations to: achieve Team Effectiveness; build Customer Trust; role model behaviors and coach Customer and other P&G resources\nManaging the Supply Trade Terms negotiations, execution and compliance as necessary in the market.\nLeading regular Supply Chain business reviews with the customer and own joint scorecard\n\n\nJob Qualifications\n\n\nBachelor's degree in Business, Science, Engineering fields or supply chain-related with an excellent academic background\n1 to 3 years of proven experience in the project management or logistics or supply chain is a plus\nMust have proven success from school or work experience of leadership and analytical thinking skills\nCurious individuals can make sophisticated decisions using all the available data but enough to use their gut feeling and instinct when these are missing.\nStrong in communication and project management\nProficient in English and Thai\n\n\nAbout Us\n\nWe produce globally recognized brands and we grow the best business leaders in the industry. With a portfolio of trusted brands as diverse as ours, it is paramount our leaders are able to lead with courage the vast array of brands, categories and functions. We serve consumers around the world with one of the strongest portfolios of trusted, quality, leadership brands, including Always®, Ariel®, Gillette®, Head & Shoulders®, Herbal Essences®, Oral-B®, Pampers®, Pantene®, Tampax® and more. Our community includes operations in approximately 70 countries worldwide.\n\nVisit http://www.pg.com to know more.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate against individuals on the basis of race, color, gender, age, national origin, religion, sexual orientation, gender identity or expression, marital status, citizenship, disability, HIV/AIDS status, or any other legally protected factor.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nJob Schedule\n\nFull time\n\nJob Number\n\nR000084562\n\nJob Segmentation\n\nRecent Grads/Entry Level (Job Segmentation)\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nการผลิต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Procter & Gamble ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "JP4lWowsl1oyOgZaXbxOlg",
    "url": "https://th.linkedin.com/jobs/view/lawyer-at-jobsrefer-indonesia-3773045172?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=JP4lWowsl1oyOgZaXbxOlg%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Lawyer\nJobsrefer Indonesia  ประเทศไทย\n19 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Jobsrefer Indonesia ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกCompany Description\n\nJobsrefer is Indonesia's first and top referral hiring smart tech platform. Our platform connects businesses with top talents via trusted referrals. By posting on Jobsrefer, businesses can find top-class talents in the shortest amount of time without having to conduct an extensive search. We aim to revolutionize the hiring process in Indonesia with our innovative approach.\n\n\n\n\nRole Description\n\nThis is a full-time remote role for a Lawyer. The Lawyer will be responsible for providing legal advice to clients, drafting legal documents and contracts, representing clients in court, conducting legal research and analysis, and negotiating on behalf of clients. The Lawyer will also be responsible for providing general counseling and guidance to clients on legal matters.\n\n\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nกฎหมาย\nอุตสาหกรรม\nบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Jobsrefer Indonesia ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "7i13Y9DU+DtiZIVC/XQfYQ",
    "url": "https://th.linkedin.com/jobs/view/regional-sales-manager-apac-at-bti-executive-search-3773089665?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=7i13Y9DU%2BDtiZIVC%2FXQfYQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Regional Sales Manager- SEA\nBTI Executive Search  กรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ BTI Executive Search ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก BTI Executive Search\n\nBenyapa Phanprechakij\nBenyapa Phanprechakij\nSenior Consultant - Industrial and Manufacturing at BTI Executive Search\n\nJob Description\n\nFunctional\n\nSet and communicate the vision and mission for the region: train, develop, mentor and motivate the sales & account management team to success.\nLead a Regional Sales organization, with direct line management of sales Managers to close new business as well as grow existing accounts.\nDirect activities of assigned Business Development Representatives and their efforts in building pipelines.\nAlign field execution with the strategic priorities of the business, coaching and mentoring the commercial team to drive funnel and software bookings growth.\nRenew and retain existing customers while growing market share through new customer acquisition.\nDrives funnel management , accurate forecasting and reporting by effectively utilizing CRM system (SalesForce).\nEstablish and maintain contact with channel partners & customers as part of a relationship matrix ensuring company is perceived as a trusted advisor, not merely a vendor. Includes regular interactions with executives of major and prospective clients, working in partnership with the Customer Success Managers.\n\n\n\n\nLeadership\n\nLine management of a team of Sales & Account Managers within the Sales organization in accordance with Core behaviors and best practice to ensure a highly motivated and effective team where talent is retained, and succession strategies developed and executed.\nFocus on talent development within your team as well as hiring and retaining a diverse and inclusive workforce.\nSet clear performance objectives and goals for the team, aligned to the overall Sales strategy, and work with the HR team to ensure an appropriate competency framework is in place to drive a high performing Sales team.\nInterview, select, coach, train, instruct, manage, and appraise the performance of associated Sales team members and mentor associates as appropriate.\nWork with the Sales Leadership to ensure that the Sales function is adequately resourced and trained to deliver an efficient service to internal and external customers.\nActively promote and lead the use of Company System tools within own team through continuous development, integration, and effective deployment. Identify opportunities for standard work and implement them as appropriate.\n\nSales Channel Management teams\n\nMonitor a sales team of professionals in the region.\nMonitoring existing relationships with re-sellers & dealers\nMonitoring sales performance within the channel partner network\nMeeting quarterly and annual plans\nDeveloping and building strategic relationships within the channel\n\nQualifications:\n\nAt least 15 ~20 years of extensive sales and marketing experience with proven, successful track record during that time.\nHas an experience to manage a team of sales professional, a technical or business degree preferable.\nStrong technical background, preferably with an expertise from one of the following areas – paint/textile/automotive & print packaging. A qualification in color critical matters would be appreciated.\nProved ability to build long term effective relationships with all kinds of business partners (distributors, dealers, key accounts, end-users, opinion makers) as well as the proven ability to manage and develop those.\nExcellent negotiations and communication skills, including public speeches, presentations, face-to-face communication.\nResult oriented, open-minded, pro-active, stress-resistant, and analytical thinking with distinct planning and organizational skills.\nAble to manage a commercial team of sales professionals and a is a good team leader. Also work independently with only general guidance.\nGlobal mindset and readiness to travel extensively.\nFluent English in spoken as well as written form.\nGood computer knowledge (Microsoft Office, desirably also Adobe products).\nAbility to communicate appropriately and professionally at all levels, both internally and externally.\nExperience of product demonstration to customers at different levels.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้บริหาร\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการพัฒนาธุรกิจและSales\nอุตสาหกรรม\nบริการการพิมพ์และการผลิตบรรจุภัณฑ์และภาชนะ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ BTI Executive Search ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "A2iL1I5DZMrwx88ZmHDzEw",
    "url": "https://th.linkedin.com/jobs/view/customer-service-agent-at-a-p-moller-maersk-3777547195?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=A2iL1I5DZMrwx88ZmHDzEw%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Customer Service Agent\nA.P. Moller - Maersk  เขตปริมณฑลกรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ A.P. Moller - Maersk ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก A.P. Moller - Maersk\n\nThinh Huynh\nThinh Huynh\nSenior Recruiter @ Maersk | Driving APAC Talent Acquisition\n\nWe are a leading logistics company that provides end-to-end solutions for our clients’ needs. We are looking for a customer service agent who can handle inquiries, complaints, and requests from our customers and carriers.\n\nAs a customer service agent, you will:\n\nBooking Service :\n\nReceive production plan and PO from the customer (via Email).\nCheck vessel schedule and process the booking.\nSubmit SI and VGM to the liners/FFW\nSubmit DG net (if applicable).\nVerify accuracy on Draft B/L and confirm with the liners or agents.\n\nCHB Documentation:\n\nReceive shipping documents from the customer and verify data accuracy on the invoice, packing list, booking confirmation, etc.\nCheck emails.\nSave files in the shared drive.\nVerify the packing list and invoice.\nCross-check details with the carrier's website.\nPrepare shipping documents for the EDI team to draft the export entry\nProvide the draft entry to the customer for verification.\nPrepare supporting documents for the Team Form for FTA, C/O submisson (if applicable)\nFollow up on the status of Customs Declaration (0409) and print out a soft copy.\n\nTruck Booking\n\nManage the loading plan and book trucks either via the intermodal team or directly through the truck supplier.\nCoordinate with the INT team or truck supplier.\nVerify truck details (truck number, driver's name, and telephone number).\nCheck the seal number.\nThen update truck detail to customer via email.\nCheck and confirm the loading plan or slot-time with the custom\nConfirm the slot-time with the dispatch/truck supplier.\nProvide the goods control list to the shipping/truck suppliers.\n\nInvoice & Billing\n\nUpdate the daily tracking file by filling up all the necessary data and shipment detail to Finops team\nCoordinate with Finops team to Opening/Closing jobs in Kewill, including the process of issue invoice to customer\nFollow up payment with customer\nClearing the workflow\n\nAdvance payment\n\nPrepare CHQ and cash advance via the system, then print them out to request an approval from team manager\nArrange the payment to carrier onbehalf of customer\n\nOther activities:\n\nInitiate the necessary actions for business that has been closed\nAccompany the sales team on customer visits (upon request).\nAttend team meetings.\n\n\n\n\nTo be successful in this role, you should have:\n\nA Bachelor degree or Master degree in logistics, business, or a related field\n1 - 2 years of experience working in Logistics Industry\nAble to handle multi-task\nWork well independently and in a team environment\nPatience when handling tough cases\nCustomer service or customer support experience is a plus\nGood communication in Thai and English both in written and speaking\nAble to work on the weekend and public holiday\nLeadership and confidence\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nฝ่ายบริการลูกค้าและซัพพลายเชน\nอุตสาหกรรม\nการขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บ คลังสินค้าและการจัดเก็บ และการค้าส่งการนำเข้าและส่งออก\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ A.P. Moller - Maersk ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "k3Ljb24lahCnRxmC+4ZG/w",
    "url": "https://th.linkedin.com/jobs/view/project-manager-at-flash-express-3773085772?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=k3Ljb24lahCnRxmC%2B4ZG%2Fw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Project Manager\nFlash Express  กรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Flash Express ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกResponsibilities:\n\nResponsible for preparing the project implementation plan, coordinating resources, promoting project implementation and delivering the implementation results on time and with quality.\nImplement, organize and mobilize the entire team to fully perform the tasks required.\nDispatch resources according to needs, control project costs and achieve project management goals.\nResponsible for cross-departmental and external coordination when handling project-related matters.\nResponsible for customer relationship development and maintenance, assisting the company to carry out commercial tasks.\nFormulate various project management processes, management regulations and standardization of logistics service management.\nOrganize internal and external training.\n\n\n\n\nQualifications:\n\nHave good execution, responsibility and curiosity in learning.\nMust be Thai nationality.\nMore than 5 years of professional logistics experience, including 1 year or more of logistics management experience.\nAble to manage and control the relevant departments, good communication and coordination skills, focus on team building spirit.\nGood communication in Thai and English.\nProficiency in Microsoft and software such as (Excel/project/ Visio /mind Map).\n\n\n\n\n\n\n\nWorking hours: Mon-Sat, 9.00 -18.00 (Work from home on Saturday ）\n\nLocation: MRT Rama 9, Unilever House (BKK)\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหารโปรเจค ฝ่ายบริการลูกค้า และการพัฒนาธุรกิจ\nอุตสาหกรรม\nการขนส่งสินค้าและบรรจุภัณฑ์ การขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บ และการขนส่งทางรถบรรทุก\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Flash Express ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "tlkg3EVSZbbhY6DN3nL1nw",
    "url": "https://th.linkedin.com/jobs/view/customer-service-experience-lead-service-improvement-at-shopee-3778130071?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=tlkg3EVSZbbhY6DN3nL1nw%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Customer Service Experience Lead (Service Improvement)\nShopee  กรุงเทพมหานคร\n9 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\nLead and drive customer satisfaction, identify opportunities and determine strategies to improve overall customer service experience, leveraging emerging technologies, methodologies, and industry best practices.\nDevelop and execute a strategic roadmap for customer experience improvement projects aligned with the company's overarching goals and customer-centric vision.\nEnd-to-end project management of customer experience and service quality improvement initiatives (inclusion of project initiation, time & resource planning, stakeholder alignment, execution, monitoring and evaluation)\nLead the prioritization, selection, and management of customer experience projects, ensuring alignment with strategic objectives and resource optimization.\nWork closely with executive leadership, department heads, and stakeholders to align project objectives with strategic quality improvement initiatives.\nEstablish quality indicator metrics, tracking and monitoring process to evaluate projects success and impact on customer satisfaction, presenting findings to stakeholders.\nImplement change management strategies to drive adoption of new processes, technologies, or initiatives among customer service teams.\nIdentify potential risks and develop proactive mitigation strategies to ensure successful project delivery and minimal disruption to customer service operations.\nRegularly assess and refine the customer service quality based on market trends, customer feedback, and business goals.\nObserve (on-the-ground) agents behaviors and performance to validate effectiveness of agents & operation to address necessary corrections\nIdentify and assess agent quality performance through data-driven analysis\nCoach and guide each team member to perform corrective actions across for agents across all channels, SOP, functional teams\nEnsure that everyone in the team reaches their maximum potential\n\n\nRequirements\n\n\nThai nationality\nBachelor's Degree in any related field.\nAt least 4++ years’ experience in Project Management or Customer Experience/Quality Auditor/Quality Inspection, preferably in technology/e-commerce environments.\nCustomer service orientation, with sound judgment and dedication to providing exceptional service quality.\nFlexible and open-minded with good service mind with the ability to handle customer's complaint and inquiry\nStrong logic, problem solving, data analysis skills and competent at interpreting KPIs data into practical gap analysis assumption and execution of improvements\nStrong written and verbal communication/presentation skills and can convey messages expressively and structurely\nStrong leadership, resilience to work under tight deadlines and pressure\nAbility to deal with ambiguity and complex, matrixed environments with minimal oversight.\nHappy to work in a fast-paced, fast evolving environment\nMust adapt and respond well to changes and effectively re-adjust priorities as needed;\nLearn fast, act fast with strong attention to detail and accuracy\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nอื่น ๆ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "lX3VRXvTJjO2ei649a1B5Q",
    "url": "https://th.linkedin.com/jobs/view/assistant-brand-manager-gregory-at-sfg-star-fashion-group-3773034611?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=lX3VRXvTJjO2ei649a1B5Q%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Assistant Brand Manager (Gregory)\nSFG | star fashion group  กรุงเทพมหานคร, ประเทศไทย\n23 ชั่วโมงก่อน  ผู้สมัคร 28 คน\n  \nดูบุคคลที่ SFG | star fashion group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก SFG | star fashion group\n\nAnnop P.\nAnnop P.\nHead of Human Resources Division\n\nResponsibilities :\n\nCoordinate with Brand Principles and create and/or implement marketing campaigns on communication and merchandising activities.\nParticipate and deliver ideas, key performance indicators, tactical plans and strategy to ensure company strategic goals are achieved.\nOversee sales forecasting, stocks, sales figure (P&L) on each promotion & channel as well as related reporting.\nManage and create contents for social media channels & other owned platforms.\nBuild relationships and coordinate with influencers & KOL for product seeding.\nEvaluate current marketing program and recommend improvements.\nCreate marketing strategy to support each E-Commerce Platforms or related channels.\nManage Brand CI and coordinate with art departments to develop brand artworks and visual merchandising.\nWork with multi-functional team and E-Retailer to plan and execute all the E-Commerce related activities.\nStay updated with latest marketing trends and competitor activities.\n\n\n\n\nQualifications :\n\nBachelor’s degree or higher in Business Administration, Marketing or related field.\nAt least 1-5 years of experience in Management and business strategy, Marketing and Communication / Merchandising / E-commerce is a plus.\nPassionate about Fashion, Trekking, Hiking, Outdoor activities is a plus.\nGood communication and excellent in English.\nAble to work with us at Rama III Road, Bangkok.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nอุตสาหกรรม\nการค้าปลีก\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ SFG | star fashion group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "dIJODU0WS33i8I8MpZ39dA",
    "url": "https://th.linkedin.com/jobs/view/regional-development-manager-thailand-at-pearson-3769090087?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=dIJODU0WS33i8I8MpZ39dA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Regional Development Manager (Thailand)\nPearson  ประเทศไทย\n17 ชั่วโมงก่อน  ผู้สมัคร 50 คน\n  \nดูบุคคลที่ Pearson ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกKey Accountabilities\n\n\nPromote Pearson’s Work Force Skills Vocational Qualifications and its services to all private schools in the assigned countries of APAC territory.\nProvide customers with a range of support, advisory, training and development services to support sales growth.\nSecure targeted growth against agreed targets, through maintaining existing business, developing opportunities within existing customer base for upselling or cross selling Pearson products.\nCollaborate with other account managers within the Line of Business or with others to upsell/cross-sell Pearson products and services.\nUse Sales Force on daily basis to build an effective sales pipeline through entering sales opportunities and analyzing data on a variety of critical business drivers.\nDevelop relationships at all levels of the customers’ organization to identify sales opportunities, networking and fact-finding to drive achievement of plans and objectives\nDevelop trusted advisor relationships to influence key stakeholders of vocational qualifications in the assigned territory including government, non-government organizations and vocational institutions to position Pearson as the preferred education solutions provider\nMaintain regular communication and conduct annual business review with the assigned key accounts\nProactively keep up to date on industry and customer specific issues\n\n\nPersonal Style and Behaviour  \n\nYou will be accurate, flexible and responsive; hard working, organised, enthusiastic and able to juggle multiple priorities. You will feel confident working alone as well as part of wider teams and be capable of learning quickly and tackling any challenge with energy and commitment. You will be able to communicate effectively with a range of stakeholders. \n\nSkills / Capabilities\n\nEssential \n\n\nA natural sales person. A rational, assertive and confident individual who can persuade customers and articulate business needs to management\nExcellent relationships management and interpersonal skills\nStrong analytical skills, including historical sales analysis, pricing, and forecasting.\nStrong communication, problem-solving, negotiation and influencing skills plus an ability to operate in a matrix-reporting environment.\nAble to operate effectively alone, and to work through challenges independently, as well as part of a multi-country team\nExcellent spoken and written command of English (and a Thai native speaker).\n\n\nDesirable \n\n\nExperience in using Sales Force\nExperience of working within the education sector  \n\n\nWork setup\n\nThis is a remote-working role.\n\nWhat To Expect From Pearson\n\nDid you know Pearson is one of the 10 most innovative education companies of 2022?\n\nAt Pearson, we add life to a lifetime of learning so everyone can realize the life they imagine. We do this by creating vibrant and enriching learning experiences designed for real-life impact. We are on a journey to be 100 percent digital to meet the changing needs of the global population by developing a new strategy with ambitious targets. To deliver on our strategic vision, we have five business divisions that are the foundation for the long-term growth of the company: Assessment & Qualifications, Virtual Learning, English Language Learning, Workforce Skills and Higher Education. Alongside these, we have our corporate divisions: Digital & Technology, Finance, Global Corporate Marketing & Communications, Human Resources, Legal, Strategy and Direct to Consumer. Learn more at We are Pearson.\n\nWe value the power of an inclusive culture and also a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to building a workplace where talent can learn, grow and thrive.\n\nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We want a team that represents a variety of backgrounds, perspectives and skills. The more inclusive we are, the better our work will be. All employment decisions are based on qualifications, merit and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status or any other group protected by law. We strive for a workforce that reflects the diversity of our communities.\n\nTo learn more about Pearson’s commitment to a diverse and inclusive workforce, navigate to: Diversity, Equity & Inclusion at Pearson.\n\nIf you are an individual with a disability and are unable or limited in your ability to use or access our career site as a result of your disability, you may request reasonable accommodations by emailing ppsmhr@pearson.com.\n\nNote that the information you provide will stay confidential and will be stored securely. It will not be seen by those involved in making decisions as part of the recruitment process.\n\nJob: SALES\n\nOrganization: Workforce Skills\n\nSchedule: FULLTIME\n\nReq ID: 13871\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรมและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nโปรแกรมบริหารการศึกษาและผู้ให้บริการ E-Learning\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Pearson ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "eKkBk5wSZ93DOf4/pCw/bw",
    "url": "https://th.linkedin.com/jobs/view/compliance-shopee-express-at-shopee-3617391474?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=eKkBk5wSZ93DOf4%2FpCw%2Fbw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Compliance (Shopee Express)\nShopee  กรุงเทพมหานคร\n14 ชั่วโมงก่อน  ผู้สมัคร 124 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\n\n\nIdentify compliance issues expeditiously and provide recommendations balancing regulatory requirements with commercial sensibility\nAnalyze and recommend effective control system improvements based on regulatory risk assessment\nCreate and manage effective action plans in response to audit discoveries and compliance violations\nCoordinate with internal stakeholders across teams to understand business requirements and develop compliance SOP/Policies\n\n\n\n\nRequirements\n\n\n\n\n2-3 years working experience with a risk management, legal or audit\nExcel, PowerPoint, Word, Canvas\nPractical and commercial approach to problem solving\nKnowledge in Personal Data Protection\nExcellent analytical skills - ability to correctly interpret underlying information and assess impact on regulatory compliance\nGood command of spoken and written in English\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการเงินและSales\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "Ltc8V46SnUn9Vk7GWSXBQg",
    "url": "https://th.linkedin.com/jobs/view/b2b-business-development-education-partners-at-elsa-corp-3773086360?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=Ltc8V46SnUn9Vk7GWSXBQg%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "B2B Business Development (Education Partners)\nELSA, Corp  ประเทศไทย\n2 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ ELSA, Corp ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก ELSA, Corp\n\nHa Ho\nHa Ho\nTalent Management\n\nLevel: Non-manager (Senior)\n\nTeam: B2B Channel Development\n\nReport to: Channel & Partnership Development Manager (SEA & Taiwan)\n\n\n\n\nThe role:\n\nWe are seeking a dynamic and results-driven Business Development (Channel Development) to spearhead our expansion into the Thai market for our cutting-edge EdTech products. As a Channel Development member in our team you’ll have the opportunity to foster your career path with the growth of a startup from Silicon Valley. Our startup culture will bring you chance and challenge, you will never have a boring day with ELSA.\n\nWhat you’ll be doing\n\nBuild pipelines through outreaching techniques: cold call, email, networking to increase brand awareness and drive new business opportunities.\nDevelop new business with clients and/or identify areas of improvement to meet sales quotas.\nOperating as the lead point of contact for any and all matters specific to your accounts\nBuilding and maintaining strong, long-lasting customer relationships\nOverseeing customer account management, including negotiating contracts and agreements to maximize profit\nLeading activities support for user engagement activities.\nCollaborate with internal stakeholders to equip for implementation & avoid any conflicts may happen.\nOperational tasks on payment, contract process, report.\n\nWhat do you need:\n\nBachelor's degree in Business, Economics, or a related field. MBA is a plus.\nProven experience in business development, sales, or marketing, with a focus on the EdTech sector.\nStrong understanding of Thai education landscape.\nExcellent negotiation, communication, and interpersonal skills.\nAbility to work independently and collaboratively in a fast-paced environment.\nFluency in English and proficiency in Thai is highly desirable.\n\nWhy will you love working here?\n\nCompetitive compensation with hot bonus per month\nFlexible working hours (Mon-Fri 9AM - 6PM), remote work\nELSA Training and ELSA Pro Accounts\nFun energetic team; international and collaborative culture\nExperience the true spirit of a fast growing and well funded Silicon Valley startup\n\nHow to apply?\n\nApply now to maximize your talents and make a real impact! Send your CV to join ELSA to giang.nguyen@elsanow.io. We would love to see your application.\n\n\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nผู้ให้บริการ E-Learning\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ ELSA, Corp ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "+9D7Ml6ys4gJquMIjm/VzA",
    "url": "https://th.linkedin.com/jobs/view/wholesale-and-b2b-manager-at-adecco-3773065696?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=%2B9D7Ml6ys4gJquMIjm%2FVzA%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Wholesale and B2B Manager\nAdecco  กรุงเทพมหานคร\n8 ชั่วโมงก่อน  ผู้สมัคร 26 คน\n  \nดูบุคคลที่ Adecco ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Adecco\n\nNichapa Paseetum\nNichapa Paseetum\nSenior Recruitment (Executive Search)\n\nAbout the Company\n\nOur client is a distinguished company with a nearly half-century legacy in distributing high-quality imported kitchen and electrical appliances. With a retail presence in leading shopping malls in Bangkok and standalone outlets, they have consistently delivered excellence to their customers.\n\n\n\n\nRole Summary\n\nThe Wholesale and B2B Manager will be dedicated to fostering sales growth and identifying business opportunities to drive overall business expansion. Your responsibilities will include analyzing and forecasting product needs for B2B and wholesale clients, particularly key account clients. Additionally, you will be responsible for cultivating and maintaining relationships to maximize potential opportunities.\n\n\n\n\nResponsibilities:\n\nWholesale Strategy Development:\n\nFormulate and execute comprehensive wholesale and B2B strategies in line with the company's overarching business goals.\nEvaluate market trends, competitor initiatives, and customer feedback to pinpoint avenues for growth and enhancement.\n\nClient Relationship Management:\n\nFoster and uphold robust connections with key wholesale clients and B2B partners.\nGrasp client needs and deliver tailored solutions to meet their specific requirements.\nAct as the primary point of contact for all inquiries related to wholesale and B2B matters.\n\nSales and Revenue Generation:\n\nEstablish ambitious sales targets and collaborate with the sales team to not only meet but surpass them.\nIdentify fresh business prospects and explore new markets to expand the wholesale and B2B clientele.\nMonitor sales performance, analyze data, and furnish executive teams with comprehensive reports on key metrics.\n\nContract Negotiation:\n\nConduct negotiations on pricing, terms, and agreements with wholesale clients and B2B partners.\nEnsure that contracts are mutually beneficial and align with company policies and standards.\n\nCollaboration and Communication:\n\nWork closely with cross-functional teams, including marketing, production, and logistics, to guarantee smooth operations.\nEffectively communicate with internal teams to convey client requirements and ensure timely order fulfillment.\n\nMarket Research and Analysis:\n\nStay abreast of industry trends, market conditions, and regulatory changes impacting wholesale and B2B operations.\nConduct regular market research to identify emerging opportunities and potential threats.\n\n\n\n\nQualifications\n\nBachelor's degree in business administration, marketing, or a related discipline.\nMinimum of 5 years of B-to-B sales experience within a retail company.\nEffective communication and negotiation abilities.\nPositive personality with proficiency in building relationships.\nDemonstrated determination to excel in challenging tasks.\nProficient in sales analysis and computer skills, particularly in MS Office, especially Excel.\nIntermediate proficiency in English, encompassing writing, listening, and speaking for internal communication.\n\n\n\n\nJob Offer\n\nVariable bonus\nGroup insurance\nProvident fund\nProduct discount\nEmergency loan\n\n\n\n\n\n\n\nFor more information and confidential discussion, please feel free to contact K Nicha via 093-7197456\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nการค้าปลีก\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Adecco ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "lczwA//RZBlNHFLEA1y5jQ",
    "url": "https://th.linkedin.com/jobs/view/business-assistant-real-estate-at-team4you-3778026943?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=lczwA%2F%2FRZBlNHFLEA1y5jQ%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Business Assistant(Real Estate)\nTeam4You  กรุงเทพมหานคร, ประเทศไทย\n17 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Team4You ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Team4You\n\nAida Borlakova\nAida Borlakova\nIT Talent Acquisition Team Lead |11 000+\n\nWe are looking for a Project manager that will be a part of Self Storage company in Thailand.Reporting to the Country Manager\n\n\n\n\nThe company provides services for personal storage of things in an automated mode.\n\nIt uses an IT platform for centralized warehouse management anywhere in the world. Now we operate in several locations, including Europe, the United Arab Emirates (UAE), and Thailand.\n\n\n\n\nKey Responsibilities:\n\nSourcing contractors and suppliers\nSupporting country manager in communication with local partners and contractors\nSourcing local engineering teams and workers\nControl of all project stages\nManaging all operational issues\n\n\n\nRequirements:\n\nYou can solve non-standard tasks\nHigh planning and organization skills for oneself and others\nAble to work under tight deadlines\nResult-oriented, not process-oriented\nYou can achieve results in uncertain situations\nBasic knowledge and experience in real estate, construction, or engineering (deep knowledge is not mandatory but is a plus)\nA diligent and responsible approach to work.\nProficiency in English and Thai languages.\n\n\n\n\nConditions:\n\nRemote work but in Bangkok\n\nPayment terms and contracts will be discussed individually with the candidate based on their experience and qualifications.\nCareer growth: Successful completion of the project and achieving set goals provide opportunities for career advancement and long-term collaboration with the company.\n\nIf you believe you meet the requirements and are ready to join us in this exciting project, we invite you to submit your application. Your professional contribution to this project will be a key factor in our success. Join us on this exciting journey of growth and development in the self-storage data industry.\n\n\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหาร\nอุตสาหกรรม\nบริการ IT และการให้คำปรึกษาด้าน IT\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Team4You ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "IhdY58T7etNs4GT82Lz0sQ",
    "url": "https://th.linkedin.com/jobs/view/finance-operations-cod-spx-at-shopee-3611204755?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=IhdY58T7etNs4GT82Lz0sQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Finance Operations, COD (SPX)\nShopee  กรุงเทพมหานคร\n14 ชั่วโมงก่อน  ผู้สมัคร 99 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\n\n\nDaily Reconcile of related transactions.\nAnalysis and reconcile report between daily report file and all of the system.\nEnsure the accounting record is correct according to the accounting systems.\nProceed report daily, weekly, monthly and related report\nCoordinate with related Team and Department.\nPerform other duties as assigned.\n\n\n\n\nRequirements\n\n\n\n\nBasic Microsoft Office/ Google G Suite is required.\nExperience on Reconcile and Settlement.\nExcellent in communication and coordination with internal stakeholders.\nAbility to work under pressure and in a fast-paced environment.\nHigh sense of responsibility and high attention to detail.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการเงินและSales\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "03ajwlYqZJ/hfE/5ceHT6g",
    "url": "https://th.linkedin.com/jobs/view/cbs-aws-executive-assistants-at-ey-3697214428?refId=BcTgWVZTfQeL1yPOJseY1g%3D%3D&trackingId=03ajwlYqZJ%2FhfE%2F5ceHT6g%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "CBS - AWS - Executive Assistants\nEY  กรุงเทพมหานคร\n15 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ EY ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Descriptions\n\n\n\n\nWorking as an Administrative Officer to support Audit team, you will perform a wide range of administrative and office support activities to facilitate the efficient operation of the organization. Your work responsibilities include but are not limited to:\n\n\n\n\nCollect data for supporting report by using Excel (Pivot, Vlookup)\nGeneral secretary and administrative work\nAll other admin matters that need to coordinate with team or firm-wide admin team (e.g., new year card, staff party, updating client mailing database, etc.)\nCoordinate with internal department for supporting document and prepare the report\n\n\n\n\nRequirements\n\n\n\n\nA few years of experience in administration and/or secretarial Support.\nBachelor degree in related field; Business Administration, Customer services or other related\nSkills in taking minutes of meeting\nAbility to communicate in English is preferred\nGood command of Microsoft programs, especially MS Excel, Word and Outlook\nWell-organized and detail-oriented\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหาร\nอุตสาหกรรม\nบริการ IT และการให้คำปรึกษาด้าน IT\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ EY ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "sWjYOkQgB/+YFXV0ZKbphg",
    "url": "https://th.linkedin.com/jobs/view/accountant-senior-and-junior-at-hrnetone-3773052139?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=sWjYOkQgB%2F%2BYFXV0ZKbphg%3D%3D&position=1&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Accountant (Senior and Junior)\nHRnetOne  กรุงเทพมหานคร, ประเทศไทย\n17 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ HRnetOne ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก HRnetOne\n\nMyo Theingi\nMyo Theingi\nAPAC | Headhunter | Recruiter | Thailand\n\nUrgently hiring for 2 Accountants position to join our clients in Thailand \n\nAccounting & Admin Manager for our global client in automation machinery manufacturing industry \nAccounting Officer for our fastest growing client in cryptocurrency/fintech industry  \n\n \n\n1. Accounting & Admin Manager  \n\n \n\nResponsibilities  \n\n \n\nSupervise the processing of invoices, payments and receivables ensuring accuracy and timeline \nOversee the month-end closing process and ensure the issuance of timely and comprehensive financial statements  \nGenerate financial statements, encompassing the trial balance, profit and loss account and balance sheet for statutory reporting \nEnsure compliance with local tax regulations and coordinate with external tax professionals as necessary  \nOversee office facilities including maintenance, security and coordination of office services \nOther general administration tasks as necessary \n\n \n\nRequirements  \n\n \n\nBachelor’s degree in Accounting, Finance or related fields \nMin 5 years of experiences in accounting and general ledger functions  \nProficiency in relevant software applications (Excel skills is a must) \nKnowledge of SAP basic is a plus \nStrong organizational and analytical skills  \nPrefer Thai locals (who is currently residing in Lam Luk Ka) with strong command in English  \n\n\n\n\n2. Accounting Officer  \n\n \n\nResponsibilities \n\n \n\nMaintain accurate and up-to-date financial records, including ledgers, journals and invoices \nProcess and manage accounts payable including verifying invoices, reconciling discrepancies, and issuing payments \nAssist in the preparation of financial statements, reports and other financial documents \nEnsure compliance with relevant financial regulations and standards \nSupport internal and external audit processes by providing necessary documentations and explanations  \n\n \n\nRequirements  \n\n \n\nBachelor’s degree in Accounting, Finance or related fields \nMin 2-3 years of relevant experience in accounting or finance \nStrong understanding of accounting principles and financial reporting \nStrong organizational and analytical skills  \nPrefer Thai locals with strong command in English \nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nอุตสาหกรรม\nบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ HRnetOne ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "oOam0BNkOqRuSYB2wEGhoQ",
    "url": "https://th.linkedin.com/jobs/view/e-commerce-customer-marketing-director-at-%E0%B8%9A%E0%B8%A3%E0%B8%B4%E0%B8%A9%E0%B8%B1%E0%B8%97-%E0%B8%A5%E0%B8%B5%E0%B9%80%E0%B8%A3%E0%B8%84%E0%B9%82%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%A8%E0%B9%84%E0%B8%97%E0%B8%A2-%E0%B8%88%E0%B8%B3%E0%B8%81%E0%B8%B1%E0%B8%94-3777290450?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=oOam0BNkOqRuSYB2wEGhoQ%3D%3D&position=5&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "E-Commerce & Customer Marketing Director\nบริษัท ลีเรคโก (ประเทศไทย) จำกัด  กรุงเทพมหานคร\n14 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ บริษัท ลีเรคโก (ประเทศไทย) จำกัด ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึก\n\nAre you seeking a new challenge? This offer might be for you!\n\nAs E-commerce and Customer Marketing Director for one of Thailand’s largest purely B2B distributors, you will be one of the SMT taking responsibility for key groups leading the development and implementation of the e-commerce platform as well as directing customer focussed commercial and marketing activities to achieve our corporate goals.\n\nE-Commerce Platform\n\n\nManagement for product & promotional content of the E-Commerce platform which represents 50% share 9and growing) of the local sales turnover.\nEvolution of the look, feel and customer experience on the e-commerce site to increase customer lifetime value.\nManaging all paid promotional aspects such as key words, paid banners, shop in shop etc.\nMaster Product Data content management and enhancement.\nSEO strategy and optimization on e-commerce site & corporate website.\nReporting sell-through & reacting to all customer interaction on the e-commerce platform with a methodological approach (plan, reporting, test and learn) through expert use of GA.\nLiaising closely with international partners for learning and best practice sharing.\n\n\n\nSales Lead and Database Management (cleaning & growth)\n\n\nOwning the relationship with external agencies providing SEM in tools like AdWords and other back-end platforms, including managing the budget and measuring ROI.\nCustomer database mining & management (cleaning and growth) to provide constant opportunities for both Telesales and Field Sales.\nAllocation & tracking through to conversion of all inbound sales leads.\n\n\n\nDirect Marketing (Email, Line and Sales) Management\n\n\nDirecting all activities on Eloqua Emailing and Line Business Tools.\nManagement of all Sales Competitions, Campaigns, Budgets and ROIs.\nExternal customer newsletters\n\n\n\nMarCom and Graphic Design\n\n\nManaging the Graphic Design team producing artworks for all off and online marketing.\nProduction of traditional catalogues and printed marketing material.\nSite owner and Editor for the Corporate Website, responsible for sourcing up to date and relevant content.\n\n\n\nQualifications & Skills\n\n\nCommercial Degree\nRelevant commercial and data based / digital work experience for the position\nHands on with Google Data Studio, Google Tag Manager, Website Development programmes such as WIX, Wordpress as well a competent HTML skills is a must\nExperience with content such as Drupal, Master Data Management such as Stibo, Power BI & SAP is a plus\nExcellent command in Thai, English & general communication skills\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nอื่น ๆ\nอุตสาหกรรม\nการค้าปลีกอุปกรณ์สำนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ บริษัท ลีเรคโก (ประเทศไทย) จำกัด ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "CMPBFR0Uf4Eg2WBpE1pSZg",
    "url": "https://th.linkedin.com/jobs/view/sales-manager-at-go-global-travel-3777523379?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=CMPBFR0Uf4Eg2WBpE1pSZg%3D%3D&position=6&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Sales Manager\nGo Global Travel  กรุงเทพมหานคร, ประเทศไทย\n7 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Go Global Travel ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Go Global Travel\n\nItzik Nachum\nItzik Nachum\nHuman Resources Business Partner\nThe role requires managing existing client accounts as well as developing new business by achieving budgeted sales within the designated territory to meet company targets. The focus is on maximizing company's sales potential, creating, and taking maximum advantage of market opportunities, crafting sales plans, and justifying these to the upper management.\nREQUIREMENTS AND SKILLS:\n• Experience in sales, customer service, or related field. • Familiarity with CRM platforms. • Strong analytical skills. • Knowledge of and insight into market trends, with an ability to think strategically. • Strong proficiency with Microsoft Office Suite. • Self-motivated and driven to succeed. • A level-head and good communication & interpersonal skills, as well as excellent problem-solving skills. • Excellent written and verbal skills.\nTASKS AND DUTIES:\n• Actively manage a wide range of key client accounts and maximize company's revenue and profitability. The focus will be Thailand but there could be other additional countries. • Perform daily account management. • Develop and implement a plan for achieving sales, profits, and minimum margin targets in line the budgetary forecasts. • Evaluate both existing clients and potential new business to identify growth opportunities to drive revenue and profit streams. • Leads Management, building up a database of prospective clients in the assigned market. • Reporting as per existing company structure • Daily Sales Monitoring • Maintain and update relevant records using company’s CRM system. • Attend and represent Go Global at Trade Shows\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nการจัดการท่องเที่ยว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Go Global Travel ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "P+oWyDoVFYIkdokliKhqWw",
    "url": "https://th.linkedin.com/jobs/view/sales-manager-at-thai-asia-pacific-brewery-co-ltd-3773085681?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=P%2BoWyDoVFYIkdokliKhqWw%3D%3D&position=7&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Sales Manager\nThai Asia Pacific Brewery Co., Ltd.  กรุงเทพมหานคร, ประเทศไทย\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Thai Asia Pacific Brewery Co., Ltd. ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Thai Asia Pacific Brewery Co., Ltd.\n\nNatedao Pimbubpha\nNatedao Pimbubpha\n\nResponsibilities :\n\nTo allot sales target for Sales Executive in line with the market condition of the responsible area according to the marketing analysis information\nTo plan sales promotion such as Consumer Promotion, Trade Promotion, Using Promotion Materials, Promotion Girl, and so on to settle sales promotion targets for Sales executive to achieve company target\nTo control, follow up, and evaluate Sales Executive performance and problem-solving\nSet up sales targets for distributors according to the market condition of the responsible area by using sales analysis information background\nTo inform distributors about the distribution policy in case of cost, quality, and market coverage\nAchieve assigned sales target, distribution, in-store execution, and customer portfolio development to drive the general trade market\nTo solve the problem in case of the performance does not meet the marketing target of the company\nEnhancing budget spending of responsibility and implementation effectively\nBuild a good relationship and set proper promotion with the outlet to increase sales volume to complete with the competitor\n\n\n\n\nQualifications :\n\n\n\n\nBachelor's degree or higher in Business administration or a related field.\nAt least 4-year experience in related FMCG sales management.\nManagement knowledge.\nGood command of written and spoken English.\nGood strategic thinking and well-planned in executions\nStrong sense of responsibility and good leadership\nMicrosoft Office (Word, Excel, PowerPoint)\nBe able to work upcountry\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSales การพัฒนาธุรกิจ และกลยุทธ์/การวางแผน\nอุตสาหกรรม\nบริการอาหารและเครื่องดื่ม การผลิต และการผลิตเครื่องดื่ม\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Thai Asia Pacific Brewery Co., Ltd. ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "BSAAZWRc/2HTNIdVyoGfyA",
    "url": "https://th.linkedin.com/jobs/view/manager-campaign-marketing-at-klook-3730127564?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=BSAAZWRc%2F2HTNIdVyoGfyA%3D%3D&position=10&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Manager, Campaign Marketing\nKlook  กรุงเทพมหานคร\n16 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ Klook ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกAbout Klook\n\n\n\n\nKlook is the go-to travel and leisure e-commerce platform for experiences and services anytime, anywhere. Founded in Hong Kong in 2014 out of passion for discovery, our purpose today is to inspire and enable more moments of JOY. Even when the COVID-19 pandemic hit, we held on to our conviction and successfully unlocked the domestic travel business. To date, we are already offering over 490,000 activities in over 1,000 destinations. With cross-border travel resuming, we have made it our mission to reshape the world of travel. Isn’t this exciting?!\n\n\n\n\nIt certainly is for our international community of over 1,200 employees, based in over 20 locations globally! Joymakers at heart, Klookers are not only curating joyful experiences for others, but also co-creating our world of joy in the Klookiverse. We are on a journey to foster a strong company culture that supports a high-performing and successful business, and we are guided by our core beliefs - Push boundaries, Ask for and give feedback, Take ownership, and Help each other - in everything we do. We are excited about building and realizing endless possibilities in the new era of travel. Care to be a part of this revolution?\n\n\n\n\nWhat you'll do:\n\n\n\n\nCampaign Strategy: Develop and execute end-to-end marketing campaigns that align with Klook's business objectives and brand identity. Collaborate with cross-functional teams to ensure campaign success.\nCampaign Planning: Plan and manage campaign budgets, timelines, and resources effectively. Monitor and optimize campaigns for maximum ROI.\nData Analysis: Analyze campaign performance data to measure the effectiveness of marketing initiatives. Identify trends, insights, and areas for improvement.\nCross-Functional Collaboration: Collaborate with Business Development Team, Creative Team, Performance Ad, Social Media, CRM and other teams to ensure seamless integration of campaign elements into the user journey.\nReporting: Prepare and present campaign performance reports to stakeholders. Use data-driven insights to make recommendations for future campaigns.\n\n\n\n\nWhat you'll need:\n\n\n\n\nBachelor's degree/ Master’s degree in Marketing, Business, Communication or a related field with at least 5 years of experience in campaign marketing, with a proven track record of successful campaigns.\nStrong understanding of digital marketing channels and best practices.\nProficiency in marketing automation tools and analytics platforms.\nExcellent verbal communication skills.\nCreative thinking and problem-solving abilities.\nStrong project management and organizational skills.\nAbility to work collaboratively in a fast-paced, dynamic environment.\nKnowledge of the travel and leisure industry is a plus.\n\n\n\n\nKlook is proud to be an equal opportunity employer. We hire talented and passionate people of all backgrounds. We believe that a joyful workplace is an inclusive workplace, one where employees from all walks of life have an equal opportunity to thrive. We’re dedicated to creating a welcoming and supportive culture where everyone belongs.\n\n\n\n\nKlook does not accept unsolicited resumes from any temporary staffing agency, placement service or professional recruiter (“Agency”). Klook will not be responsible for, and will not pay, any fees, commissions or other payments related to such unsolicited resumes.\n\n\n\n\nAn Agency must obtain advance written approval from Klook’s Talent Acquisition Team to submit resumes, and then only in conjunction with a valid fully-executed agreement for service and in response to a specific job opening for which the Agency has been requested to submit resumes for. Klook will not be responsible for, and will not pay, any fees, commissions or other payments to any Agency that does not have such agreement in place or does not comply with the foregoing.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาดและSales\nอุตสาหกรรม\nการจัดการท่องเที่ยว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Klook ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "bKPCutEAnbkl7pi0PZpdlw",
    "url": "https://th.linkedin.com/jobs/view/channel-manager-on-trade-at-thai-asia-pacific-brewery-co-ltd-3773084907?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=bKPCutEAnbkl7pi0PZpdlw%3D%3D&position=11&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Channel Manager - On Trade\nThai Asia Pacific Brewery Co., Ltd.  กรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Thai Asia Pacific Brewery Co., Ltd. ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Thai Asia Pacific Brewery Co., Ltd.\n\nNatedao Pimbubpha\nNatedao Pimbubpha\n\nResponsibilities:\n\nUnderstand consumer, channel insight, and ability to translate insight into effective Channel Strategy, plan, and program that support Company’s and brand’s objectives.\nEstablish guidelines for channel development. Adopt national strategies & initiate tactical strategies to achieve regional Sales volume targets including addressing business opportunities\nSupport on all key activities at the operational/execution level i.e. POS, Visibility, Promotion, Distribution, Roaming, Sales blitz, Brand / Local events to optimize both brand and sales achievement\nEvaluate and measure the effectiveness of all Marketing support activities and recommend actions for improvement\nControl effective planning and use of budget\nMonitor channel performance in a weekly basis and provide monthly channel performance updates in major meetings\nEnsuring alignment across the Sales and Marketing organization's on-field sales needs and marketing initiatives.\nEncourage good teamwork and communication among the commercial team\nWork closely with the sales team to effectively develop and execute trade marketing campaigns\nComply with execution guidelines and demonstrate commercial assertiveness to win in a channel with channel activities\nInfluence and inject confidence into the sales team to execute channel activities\n\n\n\n\nQualification:\n\nBachelor’s or Master’s degree in Marketing, or related field.\nMinimum of 3-5 years of middle management experience in the Commercial area (Brand, Channel, Trade marketing, and /or Sales)\nGood English communication skills.\nExperience in Marketing planning and budgeting\nStrong analytical skills and attention to detail.\nWork well with others and can work well under pressure with minimum supervision.\nGood negotiation & problem-solving skills.\n\n\n\n\n\n\n\nAttractive remuneration packages and fringe benefits await the successful candidates.\n\n\n\n\nInterested persons are invited to e-mail their applications to :\n\n\n\n\nContact to Khun Natedao\n\nnetdao@tapb.co.th\n\nTel : +6622398113\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหารโปรเจค การเงิน และการให้คำปรึกษา\nอุตสาหกรรม\nบริการอาหารและเครื่องดื่ม\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Thai Asia Pacific Brewery Co., Ltd. ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "yO24jQTA23pz944CsR+CrA",
    "url": "https://th.linkedin.com/jobs/view/supplier-quality-engineer-at-nvidia-3745776738?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=yO24jQTA23pz944CsR%2BCrA%3D%3D&position=16&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Supplier Quality Engineer\nNVIDIA  กรุงเทพมหานคร\n16 ชั่วโมงก่อน  ผู้สมัคร 156 คน\n  \nดูบุคคลที่ NVIDIA ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก NVIDIA\n\nHemachander Santhanam\nHemachander Santhanam\nManager - Recruitment at NVIDIA\nNVIDIA Networking unit is looking for Supplier Quality Engineer in Thailand, Chonburi area, who will be responsible for quality monitoring and control. Investigating, analyzing, and correcting problems in quality, production, and control at supplier locations.\n\nWhat You’ll Be Doing\n\n\nManaging and monitoring Contract Manufacturer (CM) and sub- supplier Quality performance in accordance with NVIDIA quality requirements.\nTracks, analyzes and leads initiatives for end-to-end quality aspects: supplier quality, contract manufacturer quality and customer compliant issues.\nActively represent NVIDIA Quality function in customer and supplier management reviews/ audits and follow up on audit finding items till closure.\nManage non-conformance of incoming material/ product quality issues thru NVIDIA Material Review Board (MRB) system.\nProvides risk assessment and mitigations for NPI for products/ manufacturing processes with quality mindset “Do it right at the first time and every time”.\nContinually work with suppliers to improve quality, implement process control and quality plans\nAnalyze supplier capabilities. Develop and maintain supplier quality metrics.\nPerform Contract Manufacturer (CM) and Supplier Quality Process/ System Audits to maintain and improve existing quality systems and processes.\nLead problem solving activities for ongoing quality improvement.\n\n\nWhat We Need To See\n\n\n3+ years’ experience as SQE or similar quality related or technological position\nEngineering degree in Mechanical / Materials / Electrical / electro-optics Engineering or a related field. .\nExperience as QC or QA in interconnect/cable products, cable and mechanical production processes, and optical integration production lines (PCB, PCBA – advantage).\nFamiliar with industry standard specifications, IPC, JEDEC, MIL Std, etc.\nAbility to read electronics / mechanical drawings.\nClear communication, Good English skills (Writing, Reading, Listening and Speaking)\nComputer, std Office applications: PowerPoint/Excel/word/outlook\n\n\nWays To Stand Out From The Crowd\n\n\nUnderstanding of basic quality methods and practice, Failure Mode Effect Analysis (FMEA), Six Sigma, Poka-Yoke, OOB, sampling plans and statistics.\nIPC standard certification.\nOptical and cable manufacturing process experience\n\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nธุรกิจทั่วไป\nอุตสาหกรรม\nการผลิตฮาร์ดแวร์คอมพิวเตอร์ การพัฒนาซอฟต์แวร์ และการผลิตคอมพิวเตอร์และเครื่องใช้ไฟฟ้า\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ NVIDIA ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "grl9VJIrQ3wBpFPgEVHITg",
    "url": "https://th.linkedin.com/jobs/view/sales-effectiveness-and-gtm-manager-at-reckitt-3729505639?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=grl9VJIrQ3wBpFPgEVHITg%3D%3D&position=17&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Sales Effectiveness and GTM Manager\nReckitt  กรุงเทพมหานคร\n16 ชั่วโมงก่อน  ผู้สมัคร 98 คน\n  \nดูบุคคลที่ Reckitt ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกLong Description\n\n\n\n\nWant to find a better way? As Sales Effectiveness and GTM Manager with Reckitt, you’ll have the freedom to improve the way our sales team operates.\n\n\n\n\nSales Effectiveness and GTM Manager\n\n\n\n\nBangkok, Bangkok\n\n\n\n\nCompetitive Salary & Excellent Benefits Package\n\n\n\n\nAs a Sales Effectiveness and GTM (Go-To-Market) Manager, you will be the owner of overall Sales Operation effectiveness, includes sales fundamental priority, sales force discipline, GTM project, and Sales organization in field capability development, reward and recognition programs across levels. You will be the process owner of go-to-market (except promotion) activities, sales force capability assessment and development across channels. Sales Effectiveness and GTM Manager will be responsible for both activity planning, budget managing as well as execution in the field.\n\nResponsibilities\n\nSales Effectiveness and GTM Manager will report directly to Sales Director, coordinate with other functions including GT Sales, MT Sales, Trade Marketing and Distributor Team.\n\nSales fundamentals management:\n\nRegularly review (monthly/quarterly) and co-ordinate with Sales/other functions to ensure quantity and quality of coverage\nRegularly review (daily/monthly) sales fundamentals (call, productivity, distribution, merchandising, and initiative, sales volume) to improve results\nPlan and implement KPIs, Incentive programs to drive sales fundamental and growth. Manage KPI budget and Reward and Recognition program\n\n\nSales Operation process management:\n\nSet up daily/weekly/monthly Sales Force operation process and meeting drumbeat to enhance Sales Operation Effectiveness\n\n\nGTM Project:\n\nImplement GTM project with strong process\nMake periodical report (daily, weekly, monthly…) in timely and information sufficient manner\nInitiate GTM project to improve process/results in GT Channe\n\n\nRequirements\n\nDegree's in business related such as, Economics, Marketing or Business Administration\nExperience in sales management, preferably from FMCG industry\nAbility to develop people related programs, organization contests and GTM project\nStrong interpersonal skills in dealing with all levels of staff and management\nWilling to travel, learning new skills and exploring new geography\nAbility to prioritize multiple tasks to meet and exceed deadlines\nHas strong customer orientation and fact-based approach to decision making\nAbility to use office software applications\n\n\nEquality\n\nAt Reckitt, we recognise that in real life, great people don’t always ‘tick all the boxes’. That’s why we hire for potential as well as experience. Even if you don’t meet every point on the job description, if this role and our company feels like a good fit for you, we still want to hear from you. Come and join a team whose purpose is to protect, heal and nurture in the relentless pursuit of a cleaner and healthier world.\n\nAll qualified applicants to Reckitt will receive consideration for employment without regard to age, disability or medical condition; colour, ethnicity, race, citizenship, and national origin; religion, faith; pregnancy, family status and caring responsibilities; sexual orientation; sex, gender identity, gender expression, and transgender identity; protected veteran status; size or any other basis protected by appropriate law.\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSales\nอุตสาหกรรม\nการเช่าสินค้าอุปโภคบริโภค\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Reckitt ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "jIaZ3xbEFRkOIX0PHPt0Zw",
    "url": "https://th.linkedin.com/jobs/view/finance-manager-thailand-at-travelbullz-com-3777542428?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=jIaZ3xbEFRkOIX0PHPt0Zw%3D%3D&position=18&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Finance Manager - Thailand\nTRAVELBULLZ.COM  กรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ TRAVELBULLZ.COM ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก TRAVELBULLZ.COM\n\nKanwer Deep Singh\nKanwer Deep Singh\nFounder & President at TRAVELBULLZ.COM\n\nThe ideal candidate will be responsible for working with senior management to develop financial strategies for the organisation. You should be well-versed with compliance, bookkeeping and accounting practices in Thailand.\n\nYou are comfortable handling large amounts of data, acting as a business partner, and decision-maker, and providing regular financial reporting. \n\n \n\nResponsibilities\n\nManage Accounting and Finance functions.\nComplete financial accounting, compliances and forecasting.\nReporting and compliance with the Revenue Department.\nDeliver reports and metrics to leadership\n\n\n\n\nQualifications\n\nBachelor's degree or higher in Finance or a related field 5 - 7 years of relevant experience\nFluency in Microsoft Office suite (Outlook, Excel, Word, PowerPoint, etc.)\nDetail-oriented and analytical\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการเงินและSales\nอุตสาหกรรม\nการจัดการท่องเที่ยว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ TRAVELBULLZ.COM ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "dxyEycKiTbqRDvqAS/mXkw",
    "url": "https://th.linkedin.com/jobs/view/corporate-sales-at-globish-academia-3773035391?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=dxyEycKiTbqRDvqAS%2FmXkw%3D%3D&position=22&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Corporate Sales\nGlobish Academia  กรุงเทพมหานคร, ประเทศไทย\n23 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Globish Academia ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Globish Academia\n\nSirirat Kongtavesap\nSirirat Kongtavesap\nGlobish Academia (Thailand) Co., Ltd\n\nCorporate Sales (English Development Products)\n\n\n\n\nAbout Us: Globish Academia is a renowned leader in the education industry, dedicated to providing innovative English development products and cutting-edge corporate training solutions to businesses across Thailand. \n\n\n\n\nAs a Corporate Sales Executive, you will play a pivotal role in driving business growth and expanding our client base.\n\nYour key responsibilities will include: As a Corporate Sales Executive, your primary focus will be on driving sales and expanding our market presence. \n\nIdentifying Sales Opportunities: Proactively identify potential corporate clients and generate leads to build a robust sales pipeline.\nClient Presentations: Conduct persuasive and engaging presentations to showcase our English development products and corporate training solutions, demonstrating their value in addressing client needs.\nSales Negotiations: Utilize your exceptional negotiation skills to secure new contracts and partnerships, ensuring favorable terms for both the client and Globish Academia.\nMarket Analysis: Stay up-to-date with industry trends, competitor activities, and market demands to identify potential sales opportunities and improve our sales strategies.\n\n\n\n\nQualifications:  To excel in this role, you should possess the following qualifications:Corporate Sales Experience: Demonstrate a successful track record of at least 2 years in corporate sales, preferably in the education or training industry.\nBachelor's Degree: Hold a degree in any field, showcasing your strong educational foundation.\nConsultative Selling Skills: Previous experience in consultative selling is advantageous, demonstrating your ability to understand client needs and provide tailored solutions.\nService-Minded with Excellent Communication: Possess a service-oriented mindset, coupled with exceptional communication and presentation skills to effectively engage clients.\nFlexibility to Travel: Be willing to travel to meet clients and expand business relationships beyond the central city district.\nGood English Proficiency: Display proficiency in English to effectively communicate with both local and international clients.\n\n\n\n\nWhat We Offer:Competitive Salary Base + Uncapped Commissions: Enjoy a high base salary, complemented by an attractive commission structure that offers limitless earning potential. Your hard work and dedication will be recognized and rewarded.\nProfessional Growth: Access continuous training and development opportunities to enhance your sales skills and advance your career.\nInnovative Environment: Be part of a dynamic and forward-thinking organization that encourages creativity and embraces innovation.\nMaking a Difference: Contribute to transforming the way corporate clients approach English development and training, positively impacting their success and growth.\nMenstrual Leave: We prioritize the well-being of all employees and provide menstrual leave for all genders, fostering a supportive and inclusive work environment.\nOnline Doctor Consultation and Medication Delivery: Access convenient online doctor consultations and medication delivery services when and where you need them.\nComfortable and Convenient Office: Work in our modern and well-equipped office located at G-Tower, conveniently accessible via MRT Phra Ram 9 station.\nWorking Days: Join our team and enjoy a Monday to Friday work schedule, from 10:00 AM to 7:00 PM.\n\n\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nโปรแกรมบริหารการศึกษา\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Globish Academia ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "6tbtURinx6vQRl3jJgTkhg",
    "url": "https://th.linkedin.com/jobs/view/subcontract-operations-management-team-lead-spx-express-at-shopee-3763495230?refId=PzwnvlaAIP6QmqaCvcRxkA%3D%3D&trackingId=6tbtURinx6vQRl3jJgTkhg%3D%3D&position=23&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Subcontract Operations Management Team Lead (SPX Express)\nShopee  กรุงเทพมหานคร\n14 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\nCo-drive manpower and fleet planning with subcontractor agencies to ensure high fulfillment rate\nIdentify the right subcontractor agencies to be focused on\nManage relationships with subcontractor agencies periodically (monthly)\nDrive rate negotiations to deliver better CPO\nIdentify negotiation strategies leveraging end-to-end usage of subcontractor agencies (all miles)\nSupport lead development efforts of subcontractor agencies where needed\nCo-develop SOP for flex capabilities\nCo-drive agency bidding process\nConduct competitive benchmarking of subcontractor agency payouts\n\n\nRequirements\n\n\nBachelor's degree in Business Administration/Economics/Logistics or related fields with equivalent working experience.\nMinimum of 3 years' experience working in operations and manage team.\nExcellent written and verbal English communication abilities.\nStrong analytical, problem-solving skills, and communication skills.\nEntrepreneurial, self-driven, good leadership, and strong verbal communication skills to facilitate cross-function interactions and discussions\nProficient in the use of GSuite or Microsoft Office.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานสัญญาจ้าง\nหน้าที่งาน\nเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "Boc4HouD/UAscmeDzJdHNw",
    "url": "https://th.linkedin.com/jobs/view/technical-product-owner-at-rp-international-3773092007?refId=JTBN2Id11FxTx17a%2FphklQ%3D%3D&trackingId=Boc4HouD%2FUAscmeDzJdHNw%3D%3D&position=3&pageNum=2&trk=public_jobs_jserp-result_search-card",
    "content": "Technical Product Owner\nRP International  กรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ RP International ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก RP International\n\nAli B.\nAli B.\n\nOur direct client - who is a global management consulting and considered one of the \"Big Three\" consulting firms is looking to hire a Senior technical Product Owner in their Bangkok, Thailand office.\n\nThis is initially a 7 month contract and with a huge possibility of being extended.\n\n\n\n\nWhat are they looking for? An ideal candidate must have below skills and experience:\n\nBilingual in Thai and English\n10+ years of experience in technical product management and delivery, preferably with past experience in management consulting\nStrong technical product management skills – able to define product/platform requirements, quality-assure and accept delivery and collaborate with tech leads and SMEs in different domains\nBroad technical knowledge and delivery experience: mobile/web development (incl. micro-frontend), backend-for-frontends, event-driven architecture, machine learning and data engineering, API gateway, microservice orchestration, service mesh, container orchestration, DevSecOps, infrastructure-as-code, cloud-native infrastructure\nDomain knowledge in financial services, especially consumer/retail banking and related fintech ecosystem\nStrong stakeholder management skills with gravitas, good communications and executive presence\n\n\n\n\nQualified and interested applicants may send their updated CVs to aab@rpint.com\n\n\n\n\nWe appreciate all applications, but only those meeting the required qualifications will be contacted.\n\nLet us connect and discuss this awesome possibility!\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานสัญญาจ้าง\nหน้าที่งาน\nการจัดการสินค้า\nอุตสาหกรรม\nการจัดหาและคัดเลือกพนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ RP International ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "8o4pjydPr9+UgBeQWq1F1w",
    "url": "https://th.linkedin.com/jobs/view/assistant-investment-manager-or-investment-associate-at-nr-instant-produce-pcl-3777541566?refId=JTBN2Id11FxTx17a%2FphklQ%3D%3D&trackingId=8o4pjydPr9%2BUgBeQWq1F1w%3D%3D&position=4&pageNum=2&trk=public_jobs_jserp-result_search-card",
    "content": "Assistant Investment Manager or Investment Associate\nNR Instant Produce PCL  กรุงเทพมหานคร\n2 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ NR Instant Produce PCL ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก NR Instant Produce PCL\n\nAnuthida Chalermsirichat\nAnuthida Chalermsirichat\nNRF | Nove Foods | RCL | Plant & Bean (Thailand & UK) | Botany Petcare | City Food | 350 Corp\n\nAbout us:\n\nRegeneration Capital is an investment arm of NR Instant Produce PCL (\"NRF\"), focusing on finding and screening investment opportunities and conducting M&A of the targets in the sector, adding strategic values to NRF. https://www.linkedin.com/company/regeneration-capital/\n\n\n\n\nResponsibilities:\n\nConduct market research and identify industry trends\nPerform quantitative and qualitative analysis on targeted companies\nConduct valuation analysis of the investment opportunities including preparing financial model, identifying key value drivers and risk factors, and performing sensitivity analysis\nConduct due diligence and review transaction documents\nAssist on the execution and financing of investment opportunities including negotiation, drafting transaction documents, and designing investment structure\nProduce regular investment updates and portfolio monitoring\nAssist portfolio companies to help them grow their businesses and maximize investment value.\nExecute ad-hoc projects and other business opportunities.\nConduct the financial due diligence.\nBuild financial modeling.\n\n\n\n\nQualifications:\n\nBachelor's or master's degree in Finance, Accounting, or related fields\nAt least 1-3 years of experience in investment banking, private equity, or related fields\nCFA and FA license is highly advantageous.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการเงินและนักวิเคราะห์\nอุตสาหกรรม\nวาณิชธนกิจและหลักสำคัญเงินลงทุนและหุ้นเอกชน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ NR Instant Produce PCL ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "NEnr2CXI5ibjb9J4sLl+Ow",
    "url": "https://th.linkedin.com/jobs/view/manager-marketing-pr-activation-and-partnership-at-klook-3723033686?refId=JTBN2Id11FxTx17a%2FphklQ%3D%3D&trackingId=NEnr2CXI5ibjb9J4sLl%2BOw%3D%3D&position=9&pageNum=2&trk=public_jobs_jserp-result_search-card",
    "content": "Manager, Marketing (PR, Activation and Partnership)\nKlook  กรุงเทพมหานคร\n16 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ Klook ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกAbout Klook\n\nKlook is the go-to travel and leisure e-commerce platform for experiences and services anytime, anywhere. Founded in Hong Kong in 2014 out of passion for discovery, our purpose today is to inspire and enable more moments of JOY. Even when the COVID-19 pandemic hit, we held on to our conviction and successfully unlocked the domestic travel business. To date, we are already offering over 490,000 activities in over 1,000 destinations. With cross-border travel resuming, we have made it our mission to reshape the world of travel. Isn’t this exciting?!\n\nIt certainly is for our international community of over 1,200 employees, based in over 20 locations globally! Joymakers at heart, Klookers are not only curating joyful experiences for others, but also co-creating our world of joy in the Klookiverse. We are on a journey to foster a strong company culture that supports a high-performing and successful business, and we are guided by our core beliefs - Push boundaries, Ask for and give feedback, Take ownership, and Help each other - in everything we do. We are excited about building and realizing endless possibilities in the new era of travel. Care to be a part of this revolution?\n\nJob Overview:\n\nWe are seeking a strategic and experienced Manager, Marketing - PR, Offline Activation, and Partnership to join our dynamic marketing team at Klook. This role will be instrumental in driving brand awareness, customer engagement, and strategic partnerships. The ideal candidate will have a strong background in public relations, event activation, and partnership development.\n\nWhat you'll do:\n\nPublic Relations (PR)\n\n\nDevelop and execute a comprehensive PR strategy to enhance Klook's brand visibility and reputation.\nWorks closely with agency to build and maintain relationships with media outlets, journalists, focusing on travel & lifestyle media.\nDraft and translate press releases, media pitches, and thought leadership articles.\nMonitor media coverage and analyze PR campaign effectiveness.\n\n\nEvent Activation:\n\n\nWorks closely with agency to plan and oversee the execution of experiential marketing events, activations, and campaigns.\nCollaborate with cross-functional teams to ensure seamless event planning and execution.\nCollaborate with the marketing, product, and related teams to align strategies and maximize marketing impact.\nManage event budgets, logistics, and post-event analysis.\nDrive customer engagement and brand loyalty through impactful activations.\n\n\nPartnership Development:\n\n\nIdentify, evaluate, and negotiate strategic partnerships especially government, tourism board partnership.\nDevelop co-marketing campaigns and initiatives to drive mutual business growth.\nEstablish and maintain strong relationships with partners.\nMonitor and report on partnership performance and ROI.\n\n\nWhat you'll need:\n\n\nBachelor's degree/ Master’s degree in Marketing, Communications, Business, or a related field with at least 5 years of experience in marketing, public relations, event activation, or partnership management.\nStrong understanding of PR and marketing trends and best practices.\nExcellent communication, negotiation, and presentation skills.\nCreative thinking and problem-solving abilities.\nProven ability to manage multiple projects and meet deadlines.\nCollaborative team player with leadership skills.\nKnowledge of the travel and leisure industry is a plus.\n\n\nKlook is proud to be an equal opportunity employer. We hire talented and passionate people of all backgrounds. We believe that a joyful workplace is an inclusive workplace, one where employees from all walks of life have an equal opportunity to thrive. We’re dedicated to creating a welcoming and supportive culture where everyone belongs.\n\nKlook does not accept unsolicited resumes from any temporary staffing agency, placement service or professional recruiter (“Agency”). Klook will not be responsible for, and will not pay, any fees, commissions or other payments related to such unsolicited resumes.\n\nAn Agency must obtain advance written approval from Klook’s Talent Acquisition Team to submit resumes, and then only in conjunction with a valid fully-executed agreement for service and in response to a specific job opening for which the Agency has been requested to submit resumes for. Klook will not be responsible for, and will not pay, any fees, commissions or other payments to any Agency that does not have such agreement in place or does not comply with the foregoing.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาดและSales\nอุตสาหกรรม\nการจัดการท่องเที่ยว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Klook ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "90zKGyvDHx7UFhDB5BbgNQ",
    "url": "https://th.linkedin.com/jobs/view/technical-lead-at-true-blue-3778155949?refId=JTBN2Id11FxTx17a%2FphklQ%3D%3D&trackingId=90zKGyvDHx7UFhDB5BbgNQ%3D%3D&position=10&pageNum=2&trk=public_jobs_jserp-result_search-card",
    "content": "Technical Lead\nTrue Blue  กรุงเทพมหานคร, ประเทศไทย\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ True Blue ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก True Blue\n\nWachira Yimlamai\nWachira Yimlamai\nHeadhunter | Connecting IT talent with market leading tech companies\n\nA forward-thinking technology hub, strategically positioned in Thailand, is actively seeking a visionary Technical Lead to steer their dynamic team. Specializing in empowering Southeast Asian businesses, this company stands out as an e-commerce powerhouse. Comprising a team of tech experts, developers, architects, and designers, they are committed to advancing technology goals with a dedicated focus on e-commerce solutions. Engaged in cutting-edge projects and forging partnerships with leading e-commerce brands, the company fosters a vibrant work environment that seamlessly blends hard work with enjoyment.\n\n\n\n\nBenefits:\n\nRewarding Work Culture: Immerse yourself in a vibrant work environment that values collaboration, creativity, and personal growth.\nHealth and Well-being: Prioritize your wellness with top-notch healthcare benefits, ensuring comprehensive coverage and care.\nCareer Growth Opportunities: Embark on a journey of personal and professional development, with ample opportunities for advancement within the company.\nExciting Projects: Contribute to cutting-edge projects and collaborate with industry-leading brands for a fulfilling work experience.\nDynamic Team Environment: Thrive in a professional and dynamic atmosphere where your contributions are valued, and innovation is encouraged.\n\n\n\n\nQualifications:\n\n5+ Years in Software Development: Bring a minimum of 5 years of hands-on experience in software development.\nTechnical Leadership: Demonstrate a proven track record of leading development teams, aligning them with project goals.\nTech Proficiency: Excel in languages and frameworks such as NodeJs, Typescript, ReactJs, NextJs, NestJs, React Native, PHP, Mongo, and SQL.\nProject Management: Manage multiple projects concurrently, adapting to changing requirements.\nAnalytical Skills: Showcase strong analytical and problem-solving skills for technical process optimization.\nCommunication Excellence: Possess exceptional technical communication skills, conveying complex concepts effortlessly.\nMultitasking Prowess: Juggle multiple projects with precision, maintaining attention to detail.\n\n\n\n\nEmbark on an exciting journey with this tech-driven company, where innovation meets expertise, and each day unfolds new possibilities in a vibrant work culture!\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ True Blue ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "evBHMGJgKp3vaCl27Xz34g",
    "url": "https://th.linkedin.com/jobs/view/technical-manager-at-henkel-3708921563?refId=JTBN2Id11FxTx17a%2FphklQ%3D%3D&trackingId=evBHMGJgKp3vaCl27Xz34g%3D%3D&position=11&pageNum=2&trk=public_jobs_jserp-result_search-card",
    "content": "Technical Manager\nHenkel  ศรีราชา\n17 ชั่วโมงก่อน  ผู้สมัคร 136 คน\n  \nดูบุคคลที่ Henkel ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกAt Henkel, you can be a game changer and craft your career. Unleash your entrepreneurial spirit by bringing your ideas to life within a global team. Our leading brands and technologies, along with our high-performing businesses will provide you with countless opportunities to develop your skills and explore new paths. Your career at Henkel will contribute to a more sustainable future, while you grow within our vibrant, diverse culture of trust and belonging. If you're up for challenging the status quo, join our team of pioneers and make your mark on the future with us.\n\n\n\n\nDo you dare to make an impact?\n\n\n\n\nYour Role\n\n\n\n\nExecutes engineering processes ensuring that quality products are delivered on-time at competitive cost\nDevelopment, implementation, and constant adjustment of effective maintenance concepts\nEnsuring and permanent further development of a flexible and appropriate structure for maintenance services and projects aimed at constantly increasing the efficiency and productivity of the plant facilities.\nMonitors KPIs for engineering processes, progress against project schedules, budgets, and recommends allocation of resources as required to accomplish goal\nBuild and apply a system of continuous improvement to associated assets\nMaintains up-to-date knowledge of technical development and trends in the field of expertise to be able to analyse technology, resources, and market demand to plan and assess the feasibility of project\nResponsible for the planning, conception, performance comparison and project planning of investments in the plant. Guarantee of conformity with applicable national and European standards and directives. Checking the functionality according to factory standards and the state of the art.\nCoordinates direct projects making detailed plans to accomplish goals and directing the integration of technical activities, while driving continuous improvement of processes, quality and cost to maintain profitability and competitiveness\nSupport for the test companies and coordination of the test dates with the adjacent departments. Planning and implementation of all measures to eliminate identified defects.\nFollow-up of laws and regulations that affect the facilities in responsibility, as well as the implementation of any changes.\nResponsibility for the procurement of technical materials and management of the plant's spare parts store.\nManagement and organization of the department. Analysis, constant review, and adjustment of the training level of the employees in relation to the service requirements and the state of the art.\nDevelopment of operating instructions for the operating personnel of the systems in the subordinate area.\nOrganization of safety instructions for subordinate employees.\nEncourage and monitor employee performance. Leading, motivating, and developing subordinate employees.\nPerform other duties as assigned by superior 17. Compliance the regulations and standard of the company (e.g., GMP, ISO 50001, ISO45001, ISO22716, etc.)\n\n\nYOUR SKILLS\n\n\n\n\nBachelor and/or master’s degree\nMin. 7 years’ experiences in manufacturing. Engineering with emphasis in Mechanical and/or Electrical\nEngineering is preferred.\nEngineering Management experience required\nProject Management Experience required\nMinimum of five (5) years' work experience in manufacturing is preferred\nProcess Engineering experience required – process improvement, etc.\nFluent communication in English\nMS Office, MS Outlook\nFinance – working with capital expenditure\nProduction\nDigitalization and Optimization\nContinuous improvement and Lean Manufacturing\nExcellent organizational and leaderships skills\nAnalytical thinking and problem-solving skills\nStrong decision-making skills and a results-driven approach\n\n\n\n\nHenkel is an equal opportunity employer. We evaluate qualified applicants without regard to gender, origin, culture, mindset, generation, disability, religion and sexual orientation.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรมและวิศวกรรม\nอุตสาหกรรม\nการผลิตสารเคมีและการผลิต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Henkel ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "tLFmfGDafxB7o6CNidfTOw",
    "url": "https://th.linkedin.com/jobs/view/sales-executive-at-manpowergroup-thailand-3773091076?refId=JTBN2Id11FxTx17a%2FphklQ%3D%3D&trackingId=tLFmfGDafxB7o6CNidfTOw%3D%3D&position=14&pageNum=2&trk=public_jobs_jserp-result_search-card",
    "content": "Sales Executive\nManpowerGroup Thailand  ปทุมวัน\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ ManpowerGroup Thailand ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก ManpowerGroup Thailand\n\nWanwisa Buasri\nWanwisa Buasri\nRecruitment Consultant at ManpowerGroup Thailand\n\nJob Description :\n\n\n\n\nWork with Sales Team and relevant departments to develop business.\nVisit customer, analyze situation, follow up result and report to manager.\nFollow up and solve Sales problems to be able to meet the customer's needs.\nCommunicate, maintain and develop clients relationship.\nFind and Get contract from New prospective customers in every monthใ\nAny sales activity for increase sales target with follow up account customer to contact and internal process.\n\n\n\n\n\n\n\nQualifications :\n\n\n\n\nBachelor’s degree in any field.\nHave experience at least 2 years in Sales in any business.\nHSK4-5\nGood command in English is a must (Business level).\nDriving is advantage.\nAbility to work under pressure of deadlines and self-motivated.\n\n\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ ManpowerGroup Thailand ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  }
]